In [3]:
import pandas as pd
import os
import sqlite3

In [4]:
%run initial_gen.py

Database already exists.

In [5]:
conn = sqlite3.connect("cat_cafe.db")
cursor = conn.cursor()

In [14]:
def sql_pandas(query):
    return pd.read_sql_query(query, conn)

In [ ]:
def query(query, params=()):
    cursor.execute(query, params)
    conn.commit()

In [18]:
sql_pandas(""" SELECT * FROM sqlite_master""")

,type,name,tbl_name,rootpage,sql
0,table,Cats,Cats,2,CREATE TABLE Cats(\n cat...
1,table,Customers,Customers,380,CREATE TABLE Customers (\n ...
2,table,Adoptions,Adoptions,386,CREATE TABLE Adoptions (\n ...
3,table,Suppliers,Suppliers,392,CREATE TABLE Suppliers (\n ...
4,table,Food,Food,393,CREATE TABLE Food (\n food_...

In [17]:
sql_pandas(""" PRAGMA table_info(Cats)""")

   cid         name     type  notnull dflt_value  pk
0    0       cat_id  INTEGER        0       None   1
1    1         name     TEXT        0       None   0
2    2        breed     TEXT        1       None   0
3    3  temperament     TEXT        1       None   0
4    4   is_adopted  INTEGER        1       None   0

Syntax 

**SELECT** COLUMN NAMES (or * for everything)

**FROM** TABLE NAME

**JOIN** OTHER TABLE NAME ON WHAT COLUMNS

**WHERE** CONDITION

**GROUP BY** COLUMN NAME

## Quest 1: The New Arrivals (Difficulty: ⭐️)
A new litter of kittens has arrived! They are two ginger tabby sisters named Ginger and Spice. They're both Playful and are not yet adopted. Add them to the Cats table.

## Quest 2: Finding a Forever Home (Difficulty: ⭐️)
A customer is looking for a cat named Whiskers. Find all the information about Whiskers to see if he is available for adoption.

## Quest 3: Inventory Check (Difficulty: ⭐️)
Our inventory is running low on a specific treat. Find the stock_quantity of the item named 'Catnip Bites' from the Food table.

## Quest 4: The Adoption Rush (Difficulty: ⭐️⭐️)
The cafe is having an adoption event! We need to know which cats have already been adopted. Find the name and breed of all cats where is_adopted is 1.

## Quest 5: The Catnip Shortage (Difficulty: ⭐️⭐️)
We need to place an order for our treats. Find the total stock quantity of all items in the Treat category.

## Quest 6: Cat Cafe Menu (Difficulty: ⭐️⭐️)
A customer wants to see all the food items available. Show them all items from the Food table, but order them from the highest price to the lowest price.

## Quest 7: New Customer Registration (Difficulty: ⭐️⭐️)
A new customer, Jane Doe, with the email jane.doe@email.com just signed up. Add her to the Customers table.

## Quest 8: Updating a Misdemeanor (Difficulty: ⭐️⭐️⭐️)
Oops! One of the cat temperaments was recorded incorrectly. The cat named Mittens is actually Reserved, not Energetic. Update his temperament in the Cats table.

## Quest 9: The First Adoptee (Difficulty: ⭐️⭐️⭐️)
Luna was our first cat to find a home! Record her adoption. Luna's cat_id is 2 and she was adopted by Alice Johnson (customer_id 101) on the date '2025-01-15'. Add this new record to the Adoptions table.

## Quest 10: Supplier Spotlight (Difficulty: ⭐️⭐️⭐️)
The cafe wants to promote its local suppliers. We need a list of all food items and the name of their supplier. This requires you to JOIN the Food and Suppliers tables. Display the name of the food and the supplier_name.

## Quest 11: The Busiest Month (Difficulty: ⭐️⭐️⭐️⭐️)
Management wants to know how many adoptions happened each month. Group the adoptions by adoption_date and count how many occurred on each date.

## Quest 12: Average Meal Price (Difficulty: ⭐️⭐️⭐️⭐️)
What is the average price of all Wet Food? Find the average price of items where the category is 'Wet Food'.

## Quest 13: Customer-Cat Connection (Difficulty: ⭐️⭐️⭐️⭐️)
Management wants a full picture of our adoptions. Find the name of the customer and the name of the cat they adopted. This requires a JOIN across three tables: Customers, Adoptions, and Cats.

## Quest 14: High-Value Inventory (Difficulty: ⭐️⭐️⭐️⭐️⭐️)
Some inventory items are more valuable than others. Find the category and name of all food items where the stock_quantity is less than 50 and the price is greater than 3.00.

## Quest 15: The Unadoptables (Difficulty: ⭐️⭐️⭐️⭐️⭐️)
Which cats have not been adopted yet and are in need of a home? Find the name and temperament of all cats that have not been adopted (is_adopted is 0), and order them alphabetically by name.